#include <cstdio>

int main(){

	puts("萌萌萌萌萌萌萌萌萌萌 萌萌萌萌萌萌萌萌萌萌 哒哒哒哒哒哒哒哒哒哒");
	puts("萌萌萌萌萌萌萌萌萌萌 萌萌萌萌萌萌萌萌萌萌 哒哒哒哒哒哒哒哒哒哒");
	puts("萌萌                                 萌萌 哒哒            哒哒");
	puts("萌萌                                 萌萌 哒哒            哒哒");
	puts("萌萌                                 萌萌 哒哒            哒哒");
	puts("萌萌萌萌萌萌萌萌萌萌 萌萌萌萌萌萌萌萌萌萌 哒哒            哒哒");
	puts("萌萌萌萌萌萌萌萌萌萌 萌萌萌萌萌萌萌萌萌萌 哒哒            哒哒");
	puts("                萌萌 萌萌                 哒哒            哒哒");
	puts("                萌萌 萌萌                 哒哒            哒哒");
	puts("                萌萌 萌萌                 哒哒            哒哒");
	puts("萌萌萌萌萌萌萌萌萌萌 萌萌萌萌萌萌萌萌萌萌 哒哒哒哒哒哒哒哒哒哒");
	puts("萌萌萌萌萌萌萌萌萌萌 萌萌萌萌萌萌萌萌萌萌 哒哒哒哒哒哒哒哒哒哒");
	
	return 0;
}
